In [ ]:
## what is the probability of deley happens at certain station/time, to predict how many minutes will be deley?

In [53]:
import pandas as pd

# Read the CSV

In [84]:
# the dataset used contains all delays under 30 mins. 
df = pd.read_csv("../Data/ttc_subway_delay_2018_2019.csv", encoding='unicode_escape')
# Drop the null columns where all values are null
df.shape

(13732, 20)

In [95]:
df.nunique()

id              13732
date              730
time             1279
day                 7
station            81
code              181
min_delay         116
min_gap           125
bound               4
line                4
vehicle           636
code_info         133
latitude           74
longitude          76
line_name           4
month              12
time_range          6
month_number       12
hour               24
year                2
Time               24
Time_group          6
dtype: int64

In [85]:
# Drop the null columns where all values are null
df= df.dropna(axis='columns', how='all')
df.head(2)

,id,date,time,day,station,code,min_delay,min_gap,bound,line,vehicle,code_info,latitude,longitude,line_name,month,time_range,month_number,hour,year
0,1,2019-01-01,3:03,Tuesday,DUPONT STATION,MUATC,11,16,N,YU,6061,ATC Project,43.674584,-79.40683,Yonge University Spadina,January,9PM-1:30AM,1,3,2019
1,2,2019-01-01,3:08,Tuesday,EGLINTON WEST STATION,EUATC,11,16,S,YU,5656,ATC RC&S Equipment,43.699209,-79.435819,Yonge University Spadina,January,9PM-1:30AM,1,3,2019

In [86]:
# Drop the null columns where all values are null
df= df.dropna(axis='rows', how='all')
df.describe()

,id,min_delay,min_gap,vehicle,latitude,month_number,hour,year
count,13732.000000,13732.000000,13732.000000,13732.000000,13253.000000,13732.000000,13732.000000,13732.000000
mean,6866.500000,6.641931,9.850495,5189.117536,43.703612,6.382391,12.829231,2018.486164
std,3964.231283,12.015825,12.137669,1198.676152,0.045908,3.438495,5.963210,0.499827
min,1.000000,2.000000,0.000000,0.000000,43.637222,1.000000,0.000000,2018.000000
25%,3433.750000,3.000000,6.000000,5144.000000,43.667222,3.000000,8.000000,2018.000000
50%,6866.500000,4.000000,8.000000,5416.000000,43.687778,6.000000,13.000000,2018.000000
75%,10299.250000,6.000000,10.000000,5796.000000,43.734167,9.000000,18.000000,2019.000000
max,13732.000000,515.000000,519.000000,8065.000000,43.794167,12.000000,23.000000,2019.000000

In [87]:
df['Time'] = df['hour'].apply(lambda x: x if x > 5 else x+24)

In [88]:
min(df['Time'])

6

In [89]:
max(df['Time'])

29

In [90]:
bins = [0,6,9,16,19,25,29]
labels= ['a','b','c','d','e','f']
df['Time_group']=pd.cut(df['Time'], bins, labels=labels)

In [91]:
##df.to_csv("../Data/ttc_subway_delay_2018_2019_ml.csv")

# Data Cleaning

In [92]:
df_YU = df[df['line']=='YU']
df_YU.shape

(7061, 22)

In [93]:
##df_YU.to_csv("../Data/df_YU.csv")

In [94]:
data_YU = df_YU[['min_delay','Time_group','station','day','code']]
data_YU.nunique()

min_delay      82
Time_group      6
station        42
day             7
code          112
dtype: int64

In [96]:
data_YU.dtypes

min_delay        int64
Time_group    category
station         object
day             object
code            object
dtype: object

#  Data Pre-Processing

In [78]:
y = data_YU["min_delay"].values.reshape(-1, 1)
y

array([[11],
       [11],
       [ 6],
       ...,
       [ 3],
       [ 5],
       [ 3]], dtype=int64)

In [82]:
X = data_YU[['Time_group','day','station','code']]
X.tail()

      Time_group     day                station   code
13723          c  Monday          FINCH STATION   MUIE
13725          c  Monday    SPADINA YUS STATION  PUSTC
13726          d  Monday  EGLINTON WEST STATION  EUATC
13730          e  Monday    SPADINA YUS STATION  PUSTC
13731          e  Monday         DUNDAS STATION   SUDP

In [97]:
print(X.shape, y.shape)

(7061, 4) (7061, 1)

In [98]:
datax = X.copy()

data_encoded= pd.get_dummies(datax)
data_encoded.head()

,Time_group_a,Time_group_b,Time_group_c,Time_group_d,Time_group_e,Time_group_f,day_Friday,day_Monday,day_Saturday,day_Sunday,...,code_TUML,code_TUMVS,code_TUNIP,code_TUNOA,code_TUO,code_TUOS,code_TUS,code_TUSC,code_TUST,code_TUSUP
0,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
1,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
2,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
3,0,0,0,0,0,1,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
4,0,1,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [99]:
from sklearn.model_selection import train_test_split

In [101]:
X_train, X_test, y_train, y_test = train_test_split(
    X, y)

In [ ]:

X_scaler = MinMaxScaler().fit(X_train)
X_train_scaled = X_scaler.transform(X_train)
X_test_scaled = X_scaler.transform(X_test)


# Step 1: Label-encode data set
label_encoder = LabelEncoder()
label_encoder.fit(y_train)
encoded_y_train = label_encoder.transform(y_train)
encoded_y_test = label_encoder.transform(y_test)

# Step 2: Convert encoded labels to one-hot-encoding
y_train_categorical = to_categorical(encoded_y_train)
y_test_categorical = to_categorical(encoded_y_test)